[
  {
    "id": "portfolio-app",
    "title": "Portfolio App",
    "description": "Angular portfolio with localization, certificates, and CV. Designed with a retrowave aesthetic.",
    "image": "project-img/portfolio-app.png",
    "tags": [
      "Angular",
      "TypeScript",
      "Scss",
      "Responsive",
      "Localization",
      "Retrowave"
    ],
    "youtubeUrl": "https://www.youtube.com/embed/TOW_K5YT-bk?si=ck2dOQaDH3ywU1hq",
    "sourceUrl": "https://github.com/keeroll/Portfolio",
    "liveUrl": "",
    "downloadUrl": "",
    "detailedDescription": [
      {
        "title": "Overview",
        "content": "Portfolio web app created using Angular 20. It showcases projects, certificates, and includes my CV in multiple languages. The site is styled with a retrowave-inspired theme and is fully responsive."
      },
      {
        "title": "Key Features",
        "content": "Supports internationalization (i18n) with multiple language options, responsive layout for different devices, modular and scalable architecture, and smooth visual transitions."
      },
      {
        "title": "Technical Stack",
        "content": "Angular 20, TypeScript, SCSS, Angular Router, modern CSS (Flexbox, Grid). Built using Angular best practices for production-ready deployment."
      }
    ]
  },
  {
    "id": "clickoin",
    "title": "Clickoin",
    "description": "Clicker game with skins, rare drops, and Steam features. Built in Unity with full gamedev cycle.",
    "image": "project-img/clickoin.jpg",
    "tags": [
      "Unity",
      "C#",
      "Steam",
      "Game Dev",
      "Indie",
      "Steamworks.NET",
      "Game Design"
    ],
    "youtubeUrl": "https://www.youtube.com/embed/rMiqV9_fbdM?si=snhzmmDeY9I_9bom",
    "sourceUrl": "",
    "liveUrl": "https://store.steampowered.com/app/3401350/Clickoin/",
    "downloadUrl": "",
    "detailedDescription": [
      {
        "title": "Overview",
        "content": "Clickoin is a casual clicker game built with Unity where players earn coins, unlock skins, and receive time-based or achievement-based drops. Features include custom rarity logic, offline-safe drops, and full Steam integration."
      },
      {
        "title": "Development Process",
        "content": "I worked on game design, programming, and testing. Implemented Steam Cloud, Achievements, Inventory, and secure save encryption. Game loop iterated based on player feedback during playtests."
      }
    ]
  },
  {
    "id": "barcode-scanner",
    "title": "Barcode Scanner",
    "description": "Angular-based PWA to scan barcodes via Honeywell Captuvo on iOS using Cordova.",
    "image": "",
    "tags": [
      "Angular",
      "Ionic",
      "Cordova",
      "PWA",
      "Barcode",
      "Scanner"
    ],
    "youtubeUrl": "",
    "sourceUrl": "https://github.com/keeroll/barcode-scanner",
    "liveUrl": "",
    "downloadUrl": "",
    "detailedDescription": [
      {
        "title": "Overview",
        "content": "This PWA was a prototype project created to explore integration between Angular/Ionic and Honeywell Captuvo barcode scanners on iOS using Cordova plugins."
      },
      {
        "title": "Technical Insights",
        "content": "Implemented basic scanner detection and data retrieval, explored plugin interface options, and tested real-time scanning capabilities with external hardware."
      }
    ]
  }

]
